# -*- coding:utf-8 -*-
import xlrd
import MySQLdb
import random

letters = 'abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ-'
letters_len = len(letters)

first_city = ["贵阳市","六盘水市","遵义市","安顺市","毕节市","铜仁市","黔西南州","黔东南州","黔南州"]

second_city = [
    ["南明区","云岩区","花溪区","乌当区","白云区","观山湖区","开阳县","息烽县","修文县","清镇市"],
    ["钟山区","六枝特区","水城县","盘县"],
    ["红花岗区","汇川区","播州区","桐梓县","绥阳县","正安县","务川县","凤冈县","湄潭县","余庆县","习水县","赤水市","仁怀市"],
    ["西秀区","平坝区","普定县","镇宁县","关岭县","紫云县"],
    ["七星关区","大方县","黔西县","金沙县","织金县","纳雍县","威宁县","赫章县"],
    ["碧江区","万山区","江口县","玉屏县","石阡县","思南县","印江县","德江县","沿河县","松桃县"],
    ["兴义市", "兴仁县","普安县","晴隆县","贞丰县","望谟县","册亨县","安龙县"],
    ["镇远县","凯里市","黄平县","施秉县","三穗县","岑巩县","天柱县","锦屏县","剑河县","台江县","黎平县","榕江县","从江县","雷山县","麻江县","丹寨县"],
    ["都匀市","福泉市","荔波县","贵定县","瓮安县","独山县","平塘县","罗甸县","长顺县","龙里县","惠水县","三都县"]
]

third_city = [
    #贵阳市
    [
        ["永乐村","羊角村","水塘村","干井村","柏杨村","罗吏村","石塘村","小碧村","水坝村","云盘村","甘庄村","下坝村","二堡村","黄泥哨村","油榨村","红岩村","云关村","木头村","二戈村","摆郎村","后巢村","朝阳村","四方河村","太慈桥村"],
        ["宅吉村","安井村","雅关村","黔灵村","偏坡村","东山村","改茶村","云岩村","沙河村","三桥村","渔安村","西瓜村","茶店村","东山社区","警苑社区"],
        ["山王庙村","新哨村","思潜村","达夯村","摆早村","摆托村","新楼村","谷通村","龙井村","二关村","南街村","北街村","歪脚村","新关村","扬眉村","西街村","大坝村","云凹村","茨凹村","石板一村","石板二村","街道","鱼井村","燕楼村","坝楼村","摆古村","谷蒙村","槐舟村","旧盘村","思惹村","同心村"],
        ["东风镇","水田镇","羊昌镇","下坝镇","百宜镇","新场镇"],
    ],
    #六盘水市
    [
        ["黄土坡街道","荷城街道","凤凰街道","德坞街道","双戛街道","大河镇","汪家寨镇","大湾镇"],
        ["九龙街道","银壶街道","塔山街道","岩脚镇","木岗镇","大用镇","关寨镇","牂牁镇","新华镇","龙河镇","新窑镇","郎岱镇"],
        ["双水街道","老鹰山街道","董地街道","比德镇","化乐镇","蟠龙镇","勺米镇","都格镇","发耳镇","鸡场镇","木果镇","保华镇","阿戛镇","玉舍镇","陡箐镇"],
        ["胜境街道","翰林街道","红果街道","双龙山街道","两河街道","亦资街道","柏果镇","盘关镇","石桥镇","竹海镇","保田镇"],
    ],
    #遵义市
    [
        ["老城街道","万里路街道","中华路街道","南门关街道","延安路街道","舟水桥街道","中山路街道","北京路街道","长征街道","南关街道","忠庄街道","巷口镇","海龙镇","深溪镇","金鼎山镇","新蒲镇","虾子镇","三渡镇","新舟镇"],
        ["上海路街道","洗马路街道","大连路街道","董公寺街道","高坪街道","高桥街道","团泽镇","板桥镇","泗渡镇","沙湾镇","松林镇","毛石镇","山盆镇","芝麻镇"],
        ["南白镇","龙坑镇","三岔镇","苟江镇","三合镇","乌江镇","永乐镇","龙坪镇","团溪镇","铁厂镇","西坪镇","尚稽镇","茅栗镇","新民镇","鸭溪镇","石板镇","乐山镇","枫香镇","泮水镇"],
        ["娄山关街道","海校街道","楚米镇","新站镇","松坎镇","高桥镇","水坝塘镇","官仓镇","花秋镇","羊磴镇","九坝镇","大河镇","夜郎镇","木瓜镇","坡渡镇","燎原镇","狮溪镇"],
    ],
    #安顺市
    [
        ["南街街道","东街街道","西街街道","北街街道","东关街道","华西街道","西航街道","宋旗镇","幺铺镇","宁谷镇","龙宫镇","双堡镇","大西桥镇","七眼桥镇","蔡官镇","轿子山镇","旧州镇","新场乡","岩腊乡","鸡场乡","杨武乡","东屯乡","黄腊乡"],
        ["城关镇","白云镇","高峰镇","天龙镇","夏云镇","马场镇","乐平乡","齐伯乡"],
        ["定南街道","黄桶街道","穿洞街道","马官镇","马场镇","白岩镇","鸡场坡镇","坪上乡","补郎乡","猴场乡"],
        ["环翠街道","白马湖街道","丁旗街道","黄果树镇","江龙镇","扁担山镇","募役镇","本寨镇","大山乡","马厂乡","沙子乡","革利乡","六马镇","良田乡","简嘎乡"],
    ],
    #毕节市
    [
        ["市西街道","市东街道","三板桥街道","流沧桥街道","大新桥街道","观音桥街道","鸭池镇","梨树镇","岔河镇","朱昌镇","田坝镇","长春堡镇","撒拉溪镇","杨家湾镇","放珠镇","青场镇","水箐镇","何官屯镇","对坡镇","大银镇","林口镇","生机镇","清水铺镇"],
        ["大方镇","双山镇","猫场镇","马场镇","羊场镇","黄泥塘镇","六龙镇","达溪镇","瓢井镇","长石镇","东关乡","竹园乡","响水乡","文阁乡","绿塘乡"],
        ["莲城街道","水西街道","文峰街道","杜鹃街道","金碧镇","雨朵镇","大关镇","谷里镇","素朴镇","中坪镇","重新镇","林泉镇","金兰镇","甘棠镇","洪水镇","锦星镇","五里乡","沙井乡","绿化乡","新仁乡","钟山乡","铁石乡"],
        ["城关镇","安底镇","沙土镇","岩孔镇","禹谟镇","岚头镇","清池镇","木孔镇","长坝镇","茶园镇","后山镇","高坪镇","化觉镇","平坝乡","西洛乡"],
    ],
    #铜仁市
    [
        ["硐街道","市中街道","环北街道","河西街道","灯塔街道","坝黄镇","云场坪镇","漾头镇","桐木坪乡","滑石乡","和平乡","瓦屋乡","六龙山乡"],
        ["谢桥街道","万山镇","茶店镇","高楼坪乡","黄道","敖寨乡","下溪乡","鱼塘乡","大坪乡"],
        ["双江镇","闵孝镇","太平镇","坝盘镇","民和镇","桃映镇","怒溪镇","德旺乡","官和乡"],
        ["平溪镇","大龙镇","朱家场镇","田坪镇","新店镇","亚鱼乡"],
    ],
    #黔西南州
    [
        ["黄草街道","兴泰街道","桔山街道","丰都街道","坪东街道","木贾街道","下五屯街道","万峰林街道","敬南镇"],
        ["真武山街道","城北街道","城南街道","东湖街道","屯脚镇","百德镇","雨樟镇","潘家庄镇","下山镇","新龙场镇","巴铃镇"],
        ["盘水街道","南湖街道","龙吟镇","江西坡镇","地瓜镇","青山镇","楼下镇","罗汉镇","新店镇","兴中镇","白沙乡","高棉乡"],
        ["莲城街道","东观街道","沙子镇","碧痕镇","大厂镇","鸡场镇","花贡镇","中营镇","光照镇","茶马镇","长流乡","紫马乡","安谷乡"],
    ],
    #黔东南州
    [
        ["舞阳镇","蕉溪镇","青溪镇","羊坪镇","羊场镇","都坪镇","江古镇","涌溪乡","金堡镇","报京乡","大地乡","尚寨乡"],
        ["城西街道","大十字街道","西门街道","洗马河街道","湾溪街道","鸭塘街道","三棵树镇","舟溪镇","下司镇","旁海镇","湾水镇","炉山镇","万潮镇","龙场镇","碧波镇","凯棠镇","大风洞镇"],
        ["新州镇","旧州镇","重安镇","谷陇镇","平溪镇","野洞河镇","上塘镇","一碗水乡","纸房乡","浪洞镇","翁坪乡"],
        ["城关镇","杨柳塘镇","双井镇","牛大场镇","马号镇","白垛乡","甘溪乡","马溪乡"],
    ],
    #黔南州区
    [
        ["广惠办事处","文峰办事处","新华办事处","沙包堡办事街道","匀东镇","墨冲镇","平浪镇","毛尖镇","归兰水族乡"],
        ["金山街道","马场坪街道","凤山镇","陆坪镇","龙昌镇","牛场镇","坪镇","仙桥乡"],
        ["玉屏街道","朝阳镇","茂兰镇","甲良镇","佳荣镇","黎明关水族瑶山瑶族乡","小七孔镇"],
        ["宝山街道","德新镇","金南街道","新巴镇","盘江镇","沿山镇","昌明镇","云雾镇"],
    ]
]

sign = ["我等等等耐心的等待，你却像捉迷藏一样的躲我。 ","11.06 EXO吴亦凡的生日、吴亦凡生日快乐、我爱你! ",
        "我不爱学校，但我爱上学。因为那里有一群傻比逗我笑。 ","我 ——倔強、是 因為不想 讓你ㄡ看到 我哭、 ",
        "没人疼的孩子，始终要自己撑起一片天空。 ","玛丽莲萌鹿 最萌的鹿鹿 ","人生一场戏、你满足哥的戏、哥就满足你的戏. ",
        "别以为长个嘴就可以随便的说些B话 ","我把这种承受取名叫成熟 。 ","我心里有一个秘密 不打算告诉任何人 ",
        "怪我声音不动听 唤你多声未肯应 ","我能面无表情当做毫不在乎因为我不会怎样也不能怎样。 ",
        "低 调 从 容 过 去， 高 调 看 开 现 在。 ","繁华落寂的沧桑  ||  岁月腐蚀的地方 ",
        "老公，天塌下来怎么办  ||  老婆，有我撑着别害怕 ","仰望的太高，贬低的只有自己 ",
        "为兄弟俩肋插刀，为女人插兄弟俩刀，我真领悟中间的道理了。 ","『-傷心事 訴与誰听… ",
        "≮对不起≯我不知道该怎么忘记你., ","用我的温柔 为你打造一整个世界～ ","你是否能看到这样一个我，把你的失望变成我的难过。 ",
        "人生无非是，快乐的时候大笑，难过的时候哭泣，接着就是继续过下去。 ","你看到了没，爱让我流胆怯的泪 ",
        "奋斗的道路上，注定会有孤独陪伴 ","你就像一个噩梦一样，每次都是哭着醒来，害怕那种场景，害怕与你分开 ",
        "你给的梦和别人不同 ","阳光，很暖。你的笑，很浅。怀抱，很好。宛如梦里繁花。 ",
        "_______黑 夜 的 丿凄 凉 丶 为 谁 而 光 芒 。 ","┈+．_簞蒓;啲萿著..吔媞⒈茽[筷楽] ",
        "有那么一些候，呆呆的坐在电脑前，不知道干什么，但是也不想把它关掉。 ","I love you too much Can you feel? ",
        "网上买了个剃须刀，胡子没刮完手抖麻了 ","Waiting for your concern, until I shut the Heart ",
        "流到自己感觉到疼了才知道，然后用那些苍白的文字来填补 ","指尖蒲公英灿烂的微笑  ||  指尖向日葵满满的幸福 ",
        "书读得再好 背景再牛逼 长得再好看 不会做人你也只是个人渣 ","闺密有了新闺密我不再是她的消愁工具-友尽 ",
        "十年前我们期待青春，现在，或许是我们致青春的时候了。 ","吥 求 囬 报 的 爱 吥 是 爱，是 犯 贱。 ",
        "不要把自己想的太重要，在别人眼里你什么也不是。 ","等待只能在你身边上徘徊旋转 ","今天我闺蜜生日，祝她生日快乐好么？ ",
        "那时的书信，纯洁无瑕，带着单纯的光芒。 ","爱情不一定是男人的所有，但可能是女人的全部。 ",
        "时间依旧不紧不慢走着，带上谁丢下谁都是不知不觉、无可奈何。 ","我仰天长笑，只希望你能看见  ||  我大声呐喊，只希望你能听见 ",
        "人心凉薄 我早已明白 我亦不强求 ","一生恰如三月花，看得见开始，猜不到结局。 ","记住今日被伤，明日学会坚强...... ",
        "_我就是這樣，注定和你不﹁樣，謝謝祢欣不欣賞，我的風格是限量 ↙ ","学会适应，你就会让你的环境变的明亮。 ",
        "做一个最单纯的人  ||  走一段最幸福的路 ","不管你娶不娶我我都要嫁你  ||  不管你嫁不嫁我我都要娶你 ",
        "为贤菲恋做最大贡献的人-----张益达 ","═ 自己德 生活，还是 好无奈 ","我从来就不爱和别人争东西 你喜欢就拿去 拿得走就拿去 ",
        "失去就像溺水一样窒息。 ","我做梦都想听你说你喜欢我 可是我连这个梦都没有做到过 ","你根本就不爱我每天晚上抢我被子你娶我一定是想要报复我想要活活冻死我 ",
        "在这个冷暖自知的年代，遇见你们，真好！ ","红晕，翡翠，深红，撑起一片光艳暖人的晴空。 ","如果你那么好的脾气都会生气，我是有多任性 ",
        "因为有风有雨，所以，幸福更值得珍惜。 ","下 ㈠ 站 ＇緈 諨.。﹃ 瞬 間 旳 永 恆 ＂ ","寫一首傷感的詞  ||  譜一曲留戀的歌 ",
        "以前的太不成熟，造成今天的一切结果。 ","少年，你爱我吗  ||  菇凉，我很爱你 ","?﹏能不能麻烦你，让我有骨气、有自尊的转身。 ",
        "疯狂的傻笑、眼泪拼命的留 ","静坐常思己过，闲谈莫论人生。 ","长大了的人喜欢用沉默去接受或者拒绝 ","状态是干出来的，而不是等出来的。 ",
        "┈┾时间甾变ъú变旳罒╭ァ皒对祢旳吢(*^﹏^*) ","女人一生之中最成功的事情之一，便是选了一个对的男人。 ",
        "乡下人怎么了？乡下人都是好人！！ ","我有仨爱人，都各不相同。 ","去年买个表。qu，ni，ma，ge，bi ","我以为我可以。 ",
        "每想你一次 天空飘下一粒沙,从此就有了撒哈拉% ","你的一句轻描淡写，就将我伤到骨子里。 ","Bad days will pass 坏事情总会过去 ",
        "默 然 相 爱， 寂 静 喜 欢 。 ","穿着显瘦 脱了有肉 都叫兽 你做到了 ","别拿我变了来跟我说你不爱了 ",
        "在情感的拐角处，我们选择了背对背的方向，由此远离。 ","親愛、我們擁有壹些很單純的小幸福  ||  親愛、我們擁有壹些很美好的小幸福 ",
        "来者不拒去者不留你要走就走我挽留你大爷 ","我人生目前最大的败笔，就是我叫过你的名字。 ","用你的笑容去改变这个世界，别让这个世界改变了你的笑容。 ",
        "我想走进你眼睛里然后走到脑袋里最后住进心脏里 ","女孩子喜欢的男生，是那种正经里带一点不正经，但这点不正经还不耽误正经的那种。 ","真心对你，你不理，有心玩你，你却陪 ./* ",
        "该怎么忘记放弃？该怎么不爱不念？该怎么不痛不哭？你却不能告诉我我 该怎么做… ","我需要的是一份不必靠热情维持的关系- ","成熟，稳重，贵在坚持。。。 ",
        "不要害怕你的生活将要结束，应该担心你的生活永远不会真正开始。 ","即使你不是最好的，但却是我最珍惜的。 ",
        "他说爱你，又不是只爱你。He said I love you, not only love you. ","寂寞,，让我变的那么脆弱。 ",
        "在一段感情中，卑微的那个才是最惨的，因为他连放弃的资格都没有。 ","我的心没变，只是我选择和你背道而驰了 ",
        "兄弟虽然我们是在网络中相遇，但是我把网络看的比现实还真 /. ","如果爱情只是路过，又何必到此一游 ","有多少男人愿意蹲下身为自己的女人绑鞋带。 ",
        "谢谢你伤到我体无完肤，让我看清虚假的爱情。 ","浅唱破碎的哀笑，时间给予仅有无尽的悲伤 ",
        "男人的年轻是一种肤浅和幼稚，女人的年轻是一种资本和骄傲。 ","离开的时候别把门摔得太狠 可能你还要回来 ",
        "我们习惯了热闹，却不太习惯寂寞。  ||  我们接受了长大，却开始怀念昨天。 ","我希望我可以再帅点 希望你可以离不开我 ",
        "允许被挥霍的年代叫青春。 ","自己都自甘堕落 别人拿什么尊重你 ","风、吹痛了我的双眼、迷茫... ","过去你的笑让我神魂颠倒。 ",
        "你我终年不遇承蒙时光不弃  ||  与你生老病死走到暮年古稀 ","剥开我的心吧,里面全都是你. ","你吻我是因为你寂寞，我不反抗是因为我爱你。 ",
        "只要还有明天，今天就永远是起跑线。 ","我要继续爱你，瞒住所有人 ","讨厌听到班梦阳和战亚楠的悲情故事。 ",
        "别太注重长相，能力没写在脸上。 ","如果你不乖乖丶我就牵着你的手看mm  ||  如果你不听话丶我就勾着你的手看gg ",
        "如果我的眼涙已经流干，可惜没有如果。 ","不要跟我说生日快乐，因为我不快乐。 ","如果说岁月是把杀猪刀，那肥胖更是一把屠龙刀！ ",
        "俄无需独一无二只要你铭记于心～ ","你不惜、哪来的、执手荒年、 ","怎麼葙笕、怎麼想淰、怎麼斬斷涐扪徔間の遙逺 ",
        "他是我的男人，女人请绕道。  ||  她是我的女人，男人请走来。 ","为谁红了眼眶 ","我 奋斗 ，拼命 ，不败 ，坚持，成功 ！ ",
        "毕业之后，从此就看不到他了。 ","一生恰如三月花，看得见开始，猜不到结局。 ","╰ 开心对待每一天，真心对待每一个╯℡ ",
        "时光带走了我深爱的你，但却无法夺走我对你的思念。 ","『選擇』υ灬『逃避』一切.請勿打擾ъ- -!, ","宁可清贫自乐，不可浊富多忧。 ",
        "也许是因为付出的太多所以离开的时候会流眼泪 ","暗恋，最是那低头的温柔。 / ","想你念你却不能拥有你 ",
        "对啊 我又不是谁 凭什么让你们在乎我 ","躲在黑暗里透过眼眸，在漫长的梦境看着未知光明。 ",
        "也许我放下了,也许还没,也许连我自己都不清楚。 ","曾经以为没有你，我就没有了全世界，可现在你走了，我的世界还在。 ",
        "好汉不提当年勇，  ||  好女不提当年囧。 ","俄相信俄们会在一起，生生世世不分离。 ","老子过年烧蛇吃！这是开发者送给你的彩蛋！"
        "我再喝酒我就是狗！","构造数据真尼玛的难，难于上青天上青天~来来来跟我唱","刘峤老师长得好帅~~","张海滨学长也好帅啊~","悄悄地告诉你们啊，曽义夫就是个狗",
        "虞明金嘻嘻哈哈是个超级大笨蛋","阿里阿塞有，韩明皓学长！","杨晓慧学姐好~","万睿学姐好~好~好~","李萌学姐也好~好~好~","哈哈哈哈哈哈哈哈笑死我了~~"]

conn = MySQLdb.connect(host="127.0.0.1", user="root", passwd="123456", db="taxi", port=3306, charset="utf8")
cursor = conn.cursor()

data = xlrd.open_workbook("person.xlsx")
table = data.sheets()[0]

nrows = table.nrows
ncols = table.ncols



#随机生成微信号
def create_wechat():
    name = ''
    for i in range(2, 8):
        name += letters[random.randint(0, letters_len-1)]
    if random.randint(0, 1) == 0:
        name += str(random.randint(0, 10000))
    return name

def create_region():
    city = ''
    i = random.randint(0, len(first_city)-1)
    if random.randint(1, 3) == 1:
        j = random.randint(0, len(second_city[i])-1)
        city = str(first_city[i]) + str(second_city[i][j])
    else:
        j = random.randint(0, 3)
        k = random.randint(0, len(third_city[i][j])-1)
        city = str(first_city[i]) + str(second_city[i][j]) + str(third_city[i][j][k])
    return city

for i in xrange(1, 1004):
    name = create_wechat()
    region = create_region()
    cursor.execute("INSERT INTO weixinpersoninfo VALUES(%s, %s, %s, %s, %s, %s)",
                   (name,
                    table.cell(i, 1).value,
                    table.cell(i, 2).value,
                    table.cell(i, 3).value,
                    region,
                    # table.cell(i, 5).value)
                    str(sign[random.randint(0, len(sign)-1)]))
                   )
    conn.commit()

for i in xrange(1004, nrows):
    name = create_wechat()
    cursor.execute("INSERT INTO weixinpersoninfo VALUES(%s, %s, %s, %s, %s, %s)",
                   (name,
                    table.cell(i, 1).value,
                    table.cell(i, 2).value,
                    table.cell(i, 3).value,
                    table.cell(i, 4).value,
                    # table.cell(i, 5).value)
                    str(sign[random.randint(0, len(sign) - 1)]))
                   )
    conn.commit()

cursor.close()
conn.close()

#听说这里有一些彩蛋