# -*- coding:utf-8 -*-
import xlrd
import MySQLdb
import random

letters = 'abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ-'
letters_len = len(letters)

first_city = ["贵阳市","六盘水市","遵义市","安顺市","毕节市","铜仁市","黔西南州","黔东南州","黔南州"]

second_city = [
    ["南明区","云岩区","花溪区","乌当区","白云区","观山湖区","开阳县","息烽县","修文县","清镇","市"],
    ["钟山区","六枝特区","水城县","盘县"],
    ["红花岗区","汇川区","播州区","桐梓县","绥阳县","正安县","务川县","凤冈县","湄潭县","余庆县","习水县","赤水市 仁怀市"],
    ["西秀区","平坝区","普定县","镇宁县","关岭县","紫云县"],
    ["七星关区","大方县","黔西县","金沙县","织金县","纳雍县","威宁县","赫章县"],
    ["碧江区","万山区","江口县","玉屏县","石阡县","思南县","印江县","德江县","沿河县","松桃县"],
    ["兴义市", "兴仁县","普安县","晴隆县","贞丰县","望谟县","册亨县","安龙县"],
    ["镇远县","凯里市","黄平县","施秉县","三穗县","岑巩县","天柱县","锦屏县","剑河县","台江县","黎平县","榕江县","从江县","雷山县","麻江县","丹寨县"],
    ["都匀市","福泉市","荔波县","贵定县","瓮安县","独山县","平塘县","罗甸县","长顺县","龙里县","惠水县","三都县"]
]

third_city = [
    #贵阳市
    [
        ["永乐村","羊角村","水塘村","干井村","柏杨村","罗吏村","石塘村","小碧村","水坝村","云盘村","甘庄村","下坝村","二堡村","黄泥哨村","油榨村","红岩村","云关村","木头村","二戈村","摆郎村","后巢村","朝阳村","四方河村","太慈桥村"],
        ["宅吉村","安井村","雅关村","黔灵村","偏坡村","东山村","改茶村","云岩村","沙河村","沙河社区三桥村","渔安村","西瓜村","茶店村","东山社区","警苑社区"],
        ["山王庙村","新哨村","思潜村","达夯村","摆早村","摆托村","新楼村","谷通村","龙井村","二关村","南街村","北街村","歪脚村","新关村","扬眉村","西街村","大坝村","云凹村","茨凹村","石板一村","石板二村","街道","鱼井村","燕楼村","坝楼村","摆古村","谷蒙村","槐舟村","旧盘村","思惹村","同心村"],
        ["东风镇","水田镇","羊昌镇","下坝镇","百宜镇","新场镇"],
    ],
    #六盘水市
    [
        ["黄土坡街道","荷城街道","凤凰街道","德坞街道","双戛街道","大河镇","汪家寨镇","大湾镇"],
        ["九龙街道","银壶街道","塔山街道","岩脚镇","木岗镇","大用镇","关寨镇","牂牁镇","新华镇","龙河镇","新窑镇","郎岱镇"],
        ["双水街道","老鹰山街道","董地街道","比德镇","化乐镇","蟠龙镇","勺米镇","都格镇","发耳镇","鸡场镇","木果镇","保华镇","阿戛镇","玉舍镇","陡箐镇"],
        ["胜境街道","翰林街道","红果街道","双龙山街道","两河街道","亦资街道","柏果镇","盘关镇","石桥镇","竹海镇","保田镇"],
    ],
    #遵义市
    [
        ["老城街道","万里路街道","中华路街道","南门关街道","延安路街道","舟水桥街道","中山路街道","北京路街道","长征街道","南关街道","忠庄街道","巷口镇","海龙镇","深溪镇","金鼎山镇","新蒲镇","虾子镇","三渡镇","新舟镇"],
        ["上海路街道","洗马路街道","大连路街道","董公寺街道","高坪街道","高桥街道","团泽镇","板桥镇","泗渡镇","沙湾镇","松林镇","毛石镇","山盆镇","芝麻镇"],
        ["南白镇","龙坑镇","三岔镇","苟江镇","三合镇","乌江镇","永乐镇","龙坪镇","团溪镇","铁厂镇","西坪镇","尚稽镇","茅栗镇","新民镇","鸭溪镇","石板镇","乐山镇","枫香镇","泮水镇"],
        ["娄山关街道","海校街道","楚米镇","新站镇","松坎镇","高桥镇","水坝塘镇","官仓镇","花秋镇","羊磴镇","九坝镇","大河镇","夜郎镇","木瓜镇","坡渡镇","燎原镇","狮溪镇"],
    ],
    #安顺市
    [
        ["南街街道","东街街道","西街街道","北街街道","东关街道","华西街道","西航街道","宋旗镇","幺铺镇","宁谷镇","龙宫镇","双堡镇","大西桥镇","七眼桥镇","蔡官镇","轿子山镇","旧州镇","新场乡","岩腊乡","鸡场乡","杨武乡","东屯乡","黄腊乡"],
        ["城关镇","白云镇","高峰镇","天龙镇","夏云镇","马场镇","乐平乡","齐伯乡"],
        ["定南街道","黄桶街道","穿洞街道","马官镇","马场镇","白岩镇","鸡场坡镇","坪上乡","补郎乡","猴场乡"],
        ["环翠街道","白马湖街道","丁旗街道","黄果树镇","江龙镇","扁担山镇","募役镇","本寨镇","大山乡","马厂乡","沙子乡","革利乡","六马镇","良田乡","简嘎乡"],
    ],
    #毕节市
    [
        ["市西街道","市东街道","三板桥街道","流沧桥街道","大新桥街道","观音桥街道","鸭池镇","梨树镇","岔河镇","朱昌镇","田坝镇","长春堡镇","撒拉溪镇","杨家湾镇","放珠镇","青场镇","水箐镇","何官屯镇","对坡镇","大银镇","林口镇","生机镇","清水铺镇"],
        ["大方镇","双山镇","猫场镇","马场镇","羊场镇","黄泥塘镇","六龙镇","达溪镇","瓢井镇","长石镇","东关乡","竹园乡","响水乡","文阁乡","绿塘乡"],
        ["莲城街道","水西街道","文峰街道","杜鹃街道","金碧镇","雨朵镇","大关镇","谷里镇","素朴镇","中坪镇","重新镇","林泉镇","金兰镇","甘棠镇","洪水镇","锦星镇","五里乡","沙井乡","绿化乡","新仁乡","钟山乡","铁石乡"],
        ["城关镇","安底镇","沙土镇","岩孔镇","禹谟镇","岚头镇","清池镇","木孔镇","长坝镇","茶园镇","后山镇","高坪镇","化觉镇","平坝乡","西洛乡"],
    ],
    #铜仁市
    [
        ["硐街道","市中街道","环北街道","河西街道","灯塔街道","坝黄镇","云场坪镇","漾头镇","桐木坪乡","滑石乡","和平乡","瓦屋乡","六龙山乡"],
        ["谢桥街道","万山镇","茶店镇","高楼坪乡","黄道","敖寨乡","下溪乡","鱼塘乡","大坪乡"],
        ["双江镇","闵孝镇","太平镇","坝盘镇","民和镇","桃映镇","怒溪镇","德旺乡","官和乡"],
        ["平溪镇","大龙镇","朱家场镇","田坪镇","新店镇","亚鱼乡"],
    ],
    #黔西南州
    [
        ["黄草街道","兴泰街道","桔山街道","丰都街道","坪东街道","木贾街道","下五屯街道","万峰林街道","敬南镇"],
        ["真武山街道","城北街道","城南街道","东湖街道","屯脚镇","百德镇","雨樟镇","潘家庄镇","下山镇","新龙场镇","巴铃镇"],
        ["盘水街道","南湖街道","龙吟镇","江西坡镇","地瓜镇","青山镇","楼下镇","罗汉镇","新店镇","兴中镇","白沙乡","高棉乡"],
        ["莲城街道","东观街道","沙子镇","碧痕镇","大厂镇","鸡场镇","花贡镇","中营镇","光照镇","茶马镇","长流乡","紫马乡","安谷乡"],
    ],
    #黔东南州
    [
        ["舞阳镇","蕉溪镇","青溪镇","羊坪镇","羊场镇","都坪镇","江古镇","涌溪乡","金堡镇","报京乡","大地乡","尚寨乡"],
        ["城西街道","大十字街道","西门街道","洗马河街道","湾溪街道","鸭塘街道","三棵树镇","舟溪镇","下司镇","旁海镇","湾水镇","炉山镇","万潮镇","龙场镇","碧波镇","凯棠镇","大风洞镇"],
        ["新州镇","旧州镇","重安镇","谷陇镇","平溪镇","野洞河镇","上塘镇","一碗水乡","纸房乡","浪洞镇","翁坪乡"],
        ["城关镇","杨柳塘镇","双井镇","牛大场镇","马号镇","白垛乡","甘溪乡","马溪乡"],
    ],
    #黔南州区
    [
        ["广惠办事处","文峰办事处","新华办事处","沙包堡办事街道","匀东镇","墨冲镇","平浪镇","毛尖镇","归兰水族乡"],
        ["金山街道","马场坪街道","凤山镇","陆坪镇","龙昌镇","牛场镇","坪镇","仙桥乡"],
        ["玉屏街道","朝阳镇","茂兰镇","甲良镇","佳荣镇","黎明关水族瑶山瑶族乡","小七孔镇"],
        ["宝山街道","德新镇","金南街道","新巴镇","盘江镇","沿山镇","昌明镇","云雾镇"],
    ]
]



conn = MySQLdb.connect(host="127.0.0.1", user="root", passwd="123456", db="taxi", port=3306, charset="utf8")
cursor = conn.cursor()

data = xlrd.open_workbook("person.xlsx")
table = data.sheets()[0]

nrows = table.nrows
ncols = table.ncols



#随机生成微信号
def create_wechat():
    name = ''
    for i in range(2, 8):
        name += letters[random.randint(0, letters_len-1)]
    if random.randint(0, 1) == 0:
        name += str(random.randint(0,10000))
    return name

def create_region():
    city = ''
    i = random.randint(0, len(first_city)-1)
    if random.randint(1, 3) == 1:
        j = random.randint(0, len(second_city[i])-1)
        city = str(first_city[i]) + str(second_city[i][j])
    else:
        j = random.randint(0, 3)
        k = random.randint(0, len(third_city[i][j])-1)
        city = str(first_city[i]) + str(second_city[i][j]) + str(third_city[i][j][k])
    return city

for i in xrange(1, nrows):
    name = create_wechat()
    region = create_region()
    cursor.execute("INSERT INTO weixinpersoninfo VALUES(%s, %s, %s, %s, %s, %s)",
                   (name,
                    table.cell(i, 1).value,
                    table.cell(i, 2).value,
                    table.cell(i, 3).value,
                    region,
                    # table.cell(i, 5).value)
                    0)
                   )
    conn.commit()

cursor.close()
conn.close()